espressif/esp-now/examples/coin_cell_demo/switch/sdkconfig.defaults.v1
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.3.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c2"
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS=y
CONFIG_BOOT_ROM_LOG_ALWAYS_OFF=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_XTAL_FREQ_26=y
CONFIG_ESP_PHY_RF_CAL_NONE=y
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_EXAMPLE_USE_COIN_CELL_BUTTON_V1=y
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=2000
CONFIG_BUTTON_LONG_PRESS_TOLERANCE_MS=40
CONFIG_BUTTON_SERIAL_TIME_MS=50
CONFIG_ESPNOW_LIGHT_SLEEP=y
CONFIG_ESPNOW_CONTROL_AUTO_CHANNEL_SENDING=y
CONFIG_ESPNOW_CONTROL_WAIT_ACK_DURATION=20
CONFIG_ESPNOW_CONTROL_RETRANSMISSION_TIMES=2
CONFIG_ESPNOW_DATA_FAST_ACK=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
